app/Controllers/MovieController.php

    public function index()
    {
        $movieModel = new MovieModel();
        $reviewModel = new ReviewModel();
        $userModel = new UserModel();

        $movies = $movieModel->findAll();

        foreach ($movies as &$movie) {
            $reviews = $reviewModel->where('movie_id', $movie['id'])->findAll();

            foreach ($reviews as &$review) {
                $user = $userModel->find($review['user_id']);
---
SELECT *
FROM `movies`
SELECT *
FROM `reviews`
WHERE `movie_id` = '1'
SELECT *
FROM `users`
WHERE `users`.`id` = '1'