app/Controllers/ReviewController.php

    public function store()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/users/login')->with('error', 'You must be logged in to submit a review.');
        }

        $reviewModel = new ReviewModel();
        $reviewModel->save([
            'movie_id' => $this->request->getPost('movie_id'),
            'user_id' => session()->get('user_id'),
            'rating' => $this->request->getPost('rating'),
            'comment' => $this->request->getPost('comment'),
        ]);
---
INSERT INTO `reviews` (`movie_id`, `user_id`, `rating`, `comment`) VALUES ('6', '3', '4', 'it was nice ')

    public function delete($id)
    {
        $reviewModel = new ReviewModel();
        $review = $reviewModel->find($id);

        if ($review && session()->get('user_id') == $review['user_id']) {
            $reviewModel->delete($id);
---
SELECT *
FROM `reviews`
WHERE `reviews`.`id` = '2'
DELETE FROM `reviews`
WHERE `id` IN ('2')