app/Controllers/UserController.php

    public function authenticate()
    {
        $userModel = new UserModel();
        $user = $userModel->where('email', $this->request->getPost('email'))->first();
---
SELECT *
FROM `users`
WHERE `email` = 'raj@gmail.com'
 LIMIT 1